import 'package:flutter/material.dart';
import 'package:techblog/models/data_models.dart';

Map homePagePosterMap = {
  "imageAsset": const AssetImage("assets/images/programming.png"),
  "writer": "بهنام صادقی",
  "date": "یک روز پیش",
  "view": "728",
  "title": "دوازده قدم برنامه نویسی که زبان پایتون برای...",
};

// Blog Fake Data
List<HashTagModel> tagList = [
  HashTagModel(title: "فلاتر"),
  HashTagModel(title: "برنامه‌نویسی موبایل"),
  HashTagModel(title: "پایتون"),
  HashTagModel(title: "هوش مصنوعی"),
  HashTagModel(title: "پایتون"),
  HashTagModel(title: "سی‌شارپ"),
  HashTagModel(title: "طراحی وب‌سایت"),
  HashTagModel(title: "لینوکس"),
];

List<BlogModel> blogList = [
  BlogModel(
      id: 1,
      title: "مایکروسافت از دستیار هوش مصنوعی Copilot رونمایی کرد",
      imageUrl:
          "https://static.digiato.com/digiato/2023/05/windowscopilotlede-910x600.jpg",
      writer: "ایمان صاحبی",
      writerImageUrl:
          "https://digiato.com/wp-content/uploads/avatars/226797-142x142.jpg",
      date: "یک ساعت پیش",
      content: """ 
      Copilot در ویندوز می‌تواند محتواهایی را در که اپ‌ها می‌بینید، برایتان خلاصه و بازنویسی کند یا حتی آن‌ها را توضیح بدهد. این ابزار بسیار شبیه به پنجره گفت‌وگو در بینگ چت است، بنابراین می‌توانید سؤالات عمومی را هم از این طریق بپرسید و دیگر نیازی به جستجو در وب نداشته باشید.

البته این دستیار هوش مصنوعی به‌شکل مستقیم جایگزین نوار جستجوی موجود در تسکبار ویندوز 11 نمی‌شود و در عوض به‌صورت یک دکمه مجزا در کنار آن وجود خواهد داشت. مایکروسافت می‌گوید Copilot ویندوز یک «دستیار شخصی» است و این توصیف شباهت زیادی به توصیف کورتانا توسط این شرکت دارد.

با توجه به این که Copilot در ویندوز تلفیق شده است، می‌توانید تغییر تنظیمات را به کمک این ابزار انجام دهید. برای مثال، می‌توانید از این دستیار هوشمند بخوانید تا تنظیمات سیستم عامل را به حالت تمرکز (Focus) ببرسد.

از طرف دیگر، چون Copilot ویندوز بر پایه زیربناهای بینگ چت ساخته شده است، مایکروسافت به توسعه‌دهندگان اجازه می‌دهد تا پلاگین‌های بینگ یا حتی ChatGPT را به این دستیار هوش مصنوعی بیاورند. در نتیجه، این ابزار قادر به انجام کارهای بسیار بیشتری خواهد بود.

مایکروسافت آزمایش عمومی Copilot در ویندوز را از ماه ژوئن آغاز می‌کند تا در نهایت این قابلیت در اختیار عموم کاربران این سیستم عامل قرار بگیرد.
        """,
      views: "248"),
  BlogModel(
      id: 2,
      title:
          "گزارش سال 1401 تترلند: تعداد کاربران این صرافی ۸۷.۶ درصد افزایش یافته است",
      imageUrl:
          "https://static.digiato.com/digiato/2023/05/tetherland-910x600.jpeg",
      writer: "مجتبی آستانه",
      writerImageUrl: "https://digiato.com/author/imansahebi",
      date: "دو ساعت پیش",
      content: """ 
      Copilot در ویندوز می‌تواند محتواهایی را در که اپ‌ها می‌بینید، برایتان خلاصه و بازنویسی کند یا حتی آن‌ها را توضیح بدهد. این ابزار بسیار شبیه به پنجره گفت‌وگو در بینگ چت است، بنابراین می‌توانید سؤالات عمومی را هم از این طریق بپرسید و دیگر نیازی به جستجو در وب نداشته باشید.

البته این دستیار هوش مصنوعی به‌شکل مستقیم جایگزین نوار جستجوی موجود در تسکبار ویندوز 11 نمی‌شود و در عوض به‌صورت یک دکمه مجزا در کنار آن وجود خواهد داشت. مایکروسافت می‌گوید Copilot ویندوز یک «دستیار شخصی» است و این توصیف شباهت زیادی به توصیف کورتانا توسط این شرکت دارد.

با توجه به این که Copilot در ویندوز تلفیق شده است، می‌توانید تغییر تنظیمات را به کمک این ابزار انجام دهید. برای مثال، می‌توانید از این دستیار هوشمند بخوانید تا تنظیمات سیستم عامل را به حالت تمرکز (Focus) ببرسد.

از طرف دیگر، چون Copilot ویندوز بر پایه زیربناهای بینگ چت ساخته شده است، مایکروسافت به توسعه‌دهندگان اجازه می‌دهد تا پلاگین‌های بینگ یا حتی ChatGPT را به این دستیار هوش مصنوعی بیاورند. در نتیجه، این ابزار قادر به انجام کارهای بسیار بیشتری خواهد بود.

مایکروسافت آزمایش عمومی Copilot در ویندوز را از ماه ژوئن آغاز می‌کند تا در نهایت این قابلیت در اختیار عموم کاربران این سیستم عامل قرار بگیرد.
        """,
      views: "360"),
  BlogModel(
      id: 3,
      title: "نورالینک مجوز آزمایش بالینی انسانی خود را از FDA دریافت کرد",
      imageUrl:
          "https://static.digiato.com/digiato/2023/05/Neuralink-FDA-910x600.jpg",
      writer: "جواد تاجی",
      writerImageUrl: "https://digiato.com/author/imansahebi",
      date: "دو ساعت پیش",
      content: """ 
      Copilot در ویندوز می‌تواند محتواهایی را در که اپ‌ها می‌بینید، برایتان خلاصه و بازنویسی کند یا حتی آن‌ها را توضیح بدهد. این ابزار بسیار شبیه به پنجره گفت‌وگو در بینگ چت است، بنابراین می‌توانید سؤالات عمومی را هم از این طریق بپرسید و دیگر نیازی به جستجو در وب نداشته باشید.

البته این دستیار هوش مصنوعی به‌شکل مستقیم جایگزین نوار جستجوی موجود در تسکبار ویندوز 11 نمی‌شود و در عوض به‌صورت یک دکمه مجزا در کنار آن وجود خواهد داشت. مایکروسافت می‌گوید Copilot ویندوز یک «دستیار شخصی» است و این توصیف شباهت زیادی به توصیف کورتانا توسط این شرکت دارد.

با توجه به این که Copilot در ویندوز تلفیق شده است، می‌توانید تغییر تنظیمات را به کمک این ابزار انجام دهید. برای مثال، می‌توانید از این دستیار هوشمند بخوانید تا تنظیمات سیستم عامل را به حالت تمرکز (Focus) ببرسد.

از طرف دیگر، چون Copilot ویندوز بر پایه زیربناهای بینگ چت ساخته شده است، مایکروسافت به توسعه‌دهندگان اجازه می‌دهد تا پلاگین‌های بینگ یا حتی ChatGPT را به این دستیار هوش مصنوعی بیاورند. در نتیجه، این ابزار قادر به انجام کارهای بسیار بیشتری خواهد بود.

مایکروسافت آزمایش عمومی Copilot در ویندوز را از ماه ژوئن آغاز می‌کند تا در نهایت این قابلیت در اختیار عموم کاربران این سیستم عامل قرار بگیرد.
        """,
      views: "402"),
  BlogModel(
      id: 4,
      title:
          "سنی که برای اولین‌بار صاحب موبایل شدید، چه ارتباطی با سلامت روان شما دارد؟",
      imageUrl:
          "https://static.digiato.com/digiato/2023/05/smartphone-mental-health-910x600.jpg",
      writer: "ایمان صاحبی",
      writerImageUrl: "https://digiato.com/author/imansahebi",
      date: "سه ساعت پیش",
      content: """ 
      Copilot در ویندوز می‌تواند محتواهایی را در که اپ‌ها می‌بینید، برایتان خلاصه و بازنویسی کند یا حتی آن‌ها را توضیح بدهد. این ابزار بسیار شبیه به پنجره گفت‌وگو در بینگ چت است، بنابراین می‌توانید سؤالات عمومی را هم از این طریق بپرسید و دیگر نیازی به جستجو در وب نداشته باشید.

البته این دستیار هوش مصنوعی به‌شکل مستقیم جایگزین نوار جستجوی موجود در تسکبار ویندوز 11 نمی‌شود و در عوض به‌صورت یک دکمه مجزا در کنار آن وجود خواهد داشت. مایکروسافت می‌گوید Copilot ویندوز یک «دستیار شخصی» است و این توصیف شباهت زیادی به توصیف کورتانا توسط این شرکت دارد.

با توجه به این که Copilot در ویندوز تلفیق شده است، می‌توانید تغییر تنظیمات را به کمک این ابزار انجام دهید. برای مثال، می‌توانید از این دستیار هوشمند بخوانید تا تنظیمات سیستم عامل را به حالت تمرکز (Focus) ببرسد.

از طرف دیگر، چون Copilot ویندوز بر پایه زیربناهای بینگ چت ساخته شده است، مایکروسافت به توسعه‌دهندگان اجازه می‌دهد تا پلاگین‌های بینگ یا حتی ChatGPT را به این دستیار هوش مصنوعی بیاورند. در نتیجه، این ابزار قادر به انجام کارهای بسیار بیشتری خواهد بود.

مایکروسافت آزمایش عمومی Copilot در ویندوز را از ماه ژوئن آغاز می‌کند تا در نهایت این قابلیت در اختیار عموم کاربران این سیستم عامل قرار بگیرد.
        """,
      views: "470"),
  BlogModel(
      id: 5,
      title:
          "سامسونگ دیگر دومین برند پرفروش در بازار ساعت‌های هوشمند نیست؛ واگذاری جایگاه به یک برند هندی",
      imageUrl:
          "https://digiato.com/wp-content/uploads/2022/11/Digipics-GalaxyWatch5Pro-09-910x600.jpg",
      writer: "محمد قریشی",
      writerImageUrl: "https://digiato.com/author/imansahebi",
      date: "پنج ساعت پیش",
      content: """ 
      Copilot در ویندوز می‌تواند محتواهایی را در که اپ‌ها می‌بینید، برایتان خلاصه و بازنویسی کند یا حتی آن‌ها را توضیح بدهد. این ابزار بسیار شبیه به پنجره گفت‌وگو در بینگ چت است، بنابراین می‌توانید سؤالات عمومی را هم از این طریق بپرسید و دیگر نیازی به جستجو در وب نداشته باشید.

البته این دستیار هوش مصنوعی به‌شکل مستقیم جایگزین نوار جستجوی موجود در تسکبار ویندوز 11 نمی‌شود و در عوض به‌صورت یک دکمه مجزا در کنار آن وجود خواهد داشت. مایکروسافت می‌گوید Copilot ویندوز یک «دستیار شخصی» است و این توصیف شباهت زیادی به توصیف کورتانا توسط این شرکت دارد.

با توجه به این که Copilot در ویندوز تلفیق شده است، می‌توانید تغییر تنظیمات را به کمک این ابزار انجام دهید. برای مثال، می‌توانید از این دستیار هوشمند بخوانید تا تنظیمات سیستم عامل را به حالت تمرکز (Focus) ببرسد.

از طرف دیگر، چون Copilot ویندوز بر پایه زیربناهای بینگ چت ساخته شده است، مایکروسافت به توسعه‌دهندگان اجازه می‌دهد تا پلاگین‌های بینگ یا حتی ChatGPT را به این دستیار هوش مصنوعی بیاورند. در نتیجه، این ابزار قادر به انجام کارهای بسیار بیشتری خواهد بود.

مایکروسافت آزمایش عمومی Copilot در ویندوز را از ماه ژوئن آغاز می‌کند تا در نهایت این قابلیت در اختیار عموم کاربران این سیستم عامل قرار بگیرد.
        """,
      views: "532"),
];

List<PodcastModel> podcastList = [
  PodcastModel(
    title: "تهران پادکست",
    imageUrl: "https://tehranpodcast.ir/wp-content/uploads/2020/04/tplogo.jpg",
    writer: "باران صفایی",
    listens: "385",
  ),
  PodcastModel(
    title: "رواق",
    imageUrl: "https://tehranpodcast.ir/wp-content/uploads/2019/06/ravaq.jpg",
    writer: "منوچهر کیان",
    listens: "220",
  ),
  PodcastModel(
    title: "بی پلاس",
    imageUrl:
        "https://bpluspodcast.com/wp-content/uploads/2018/05/itunes-covers-01.png",
    writer: "علی دانش‌دوست",
    listens: "376",
  ),
  PodcastModel(
    title: "پادکست باران",
    imageUrl:
        "https://cdn.shenoto.com/shenoto-channel/9e5037be-c13d-4d84-b3b0-82f6ab6526da/cover/3000.jpg",
    writer: "پوریا احمدی پور",
    listens: "317",
  ),
  PodcastModel(
    title: "ساعت صفر",
    imageUrl:
        "https://www.navaar.ir/content/books/860a24f9-a453-49a6-bd07-a35f021e804b/pic.jpg?w=370&h=370&t=AAAAAB9AQrU=",
    writer: "محمدرضا خرم",
    listens: "340",
  ),
];
